import random
'''난수로 만드는 일라이저 알고리즘 --> 일라이저알고리즘 = 랜덤값 반복'''



a = input("당신은 누구인가요?\n 이름만 입력\n")
print( a + "님 안녕하세요!\n 지금은 무엇을 말하고싶은가요?")


print("\n 필요한 것의 번호를 입력해주세요!\n")
b = int(input("1.무엇이 필요하다\n"
                 "2.상태가 이렇다\n"))

if b == 1: #무엇이 필요하다를 선택한 경우



 num1 = random.randint(1, 2) # 1에서 2사이의 값을 정해 랜덤값 생성
 print(f'{num1}') #제대로 나오는지 확인하는 용도로 출력함
if num1 == 1: #랜덤 값이 1이면 실행
  print("왜 필요한가요?")
  d = input("\n")
  print("그렇군요..\n")
  print("도움이 필요하면 다시 불러주세요!")

if num1 == 2: #랜덤값이 2면 실행
      print(" 정말 도움이될까요?")
      d = input("\n")
      print("네, 알겠습니다.\n")
      print("도움이 필요하면 다시 불러주세요!")

if b ==2: # 상태가 이렇다를 선택한 경우


 num2 = random.randrange(5, 6)
 print(f'{num2}') # 위와 같은 과정들 반복함
 if num2 == 5:
        print("상태가 그런가요?")
        d = input("\n")
        print("괜찮을 거에요..\n")
        print("도움이 필요하면 다시 불러주세요!")

 if num2 == 6:
         print("그런 상태를 유지하는 것이 도움이 될까요?")
         d = input("\n")
         print("네, 알겠습니다.\n")
         print("도움이 필요하면 다시 불러주세요!")

'''
  결론: 오류해결 --> 오류 발생원인 == 열 구분 안했음 & 중복값 오류
         일라이저알고리즘 작동은 전술했듯이 랜덤값을 활용하기에 파이썬의 random으로 구현할 수 있었음
            + 예외상황에 대한 대답 추가 예정!
'''
